GadgetOnOff Project/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ОбъемыЗакупок</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>DefinedType.ДенежныйТип</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>EnumRef.ВидыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоступления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоймость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GadgetOnOff Project/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	 СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	 СтрокаТабличнойЧасти.ЦенаПоступления = ЦенаИзНоменклатурыНаСервере(СтрокаТабличнойЧасти.Номенклатура);
	 СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПоступления;
	 
КонецПроцедуры

&НаСервере
Функция ЦенаИзНоменклатурыНаСервере(Номенклатура)
	
	Возврат Номенклатура.ЦенаЗакупки;
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличетствоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПоступления;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПоступленияПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Стоймость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.ЦенаПоступления;
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	//Очищаем табличную часть
	Объект.Товары.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)

 Объект.Товары.Очистить();

КонецПроцедуры
